# Table of Contents
 <p><div class="lev1 toc-item"><a href="#Data-manipulation-excercises" data-toc-modified-id="Data-manipulation-excercises-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Data manipulation excercises</a></div>

# Data manipulation excercises

In this section you'll learn how to manipulate and transform your data in Pandas. Special functions like groupby, aggregate and apply will be covered.

As before - you'll be asked to fill missing **'??'** in the code with proper answers. 

In some places - where it's easy to check results - assetions will verify if your results are fine. Otherwise - you'll just have to achieve the same results as in visualizations below each excercise.

We'll be working with Titanic disaster data, as before, but for initial, simpler excercises we'll use some trivial datasets.

In [3]:
import pandas as pd
import numpy as np

# Read titanic data from data folder.
# Data is in CSV format, separated by comma, with header in zero row, no index column

titanic_df = '??'
titanic_df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [5]:
example_df = pd.DataFrame({
    'character': ['Neo', 'Trinity', 'Morpheus', 'Agent Smith', 'The Oracle', 'The Architect'],
    'origin':    ['human', 'human', 'human', 'machine', 'machine', 'machine'],
    'party': ['good', 'good', 'good', 'villains', 'good', 'villain'],
    'age': [35, 33, 40, 999, 999, 999]
    
})
example_df

   age      character   origin     party
0   35            Neo    human      good
1   33        Trinity    human      good
2   40       Morpheus    human      good
3  999    Agent Smith  machine  villains
4  999     The Oracle  machine      good
5  999  The Architect  machine   villain

In [4]:
# Group